import random
pair1 = [[0, 1, 1], [1, 0, 1], [1, 0, 0], [0, 1, 1], [1, 1, 0], [1, 1, 0], [0, 0, 0], [0, 0, 1],
         [1, 0, 0], [0, 1, 1], [0, 1, 0], [0, 1, 1], [0, 0, 1], [1, 1, 1], [1, 1, 0], [0, 0, 1]]
pair2 = [[1, 1, 1], [1, 1, 0], [1, 1, 0], [1, 1, 0], [1, 0, 1], [1, 0, 0], [1, 0, 0], [1, 0, 0],
         [0, 0, 0], [1, 1, 0], [0, 0, 1], [0, 0, 1], [0, 1, 0], [0, 1, 1], [0, 1, 1], [0, 1, 1]]
for j in range(16):
    p1 = 0
    p2 = 0
    for i in range(100000):
        last3 = []
        while True:
            x = random.choice([0, 1])
            last3.append(x)

            if len(last3) > 3:
                # 检测队列中是否有大于三个数，如果有就可以检测pop出最早进队列的数，
                # 然后将剩下三个数与已有的情况做对比，代表最先出现的情况，增加胜负局数统计
                last3.pop(0)
            if last3 == pair1[j]:
                p1 += 1
                break
            elif last3 == pair2[j]:
                p2 += 1
                break
    print("甲所猜先出现的情况",pair1[j],"最终获胜次数:", p1)
    print("乙所猜先出现的情况",pair2[j],"最终获胜次数:", p2)
    print("甲乙获胜概率之比:",p1/p2)